## PROVISION PLAN

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws.aws_s3_bucket.chat will be updated in-place
  ~ resource "aws_s3_bucket" "chat" {
      + force_destroy               = false
        id                          = "tl-public-chat-zm-prod"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (5 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket.docs will be updated in-place
  ~ resource "aws_s3_bucket" "docs" {
      + force_destroy               = false
        id                          = "tl-aselo-docs-zm-production"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket_cors_configuration.chat will be created
  + resource "aws_s3_bucket_cors_configuration" "chat" {
      + bucket = "tl-public-chat-zm-prod"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_cors_configuration.docs will be created
  + resource "aws_s3_bucket_cors_configuration" "docs" {
      + bucket = "tl-aselo-docs-zm-production"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_lifecycle_configuration.hrm_export_expiry will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "hrm_export_expiry" {
      + bucket = "tl-aselo-docs-zm-production"
      + id     = (known after apply)

      + rule {
          + id     = "HRM Exported Data Expiration Policy"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "hrm-data/"
            }
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-zm-prod"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-zm-production"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_public_access_block.chat will be created
  + resource "aws_s3_bucket_public_access_block" "chat" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "tl-public-chat-zm-prod"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.aws.aws_s3_bucket_public_access_block.docs will be created
  + resource "aws_s3_bucket_public_access_block" "docs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tl-aselo-docs-zm-production"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.chat will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "chat" {
      + bucket = "tl-public-chat-zm-prod"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.docs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "docs" {
      + bucket = "tl-aselo-docs-zm-production"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/aws/ACf0b04d307d8f20074dc09cdb3b4f0a83/region"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/ACf0b04d307d8f20074dc09cdb3b4f0a83/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/ACf0b04d307d8f20074dc09cdb3b4f0a83/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_access_token will be created
  + resource "aws_ssm_parameter" "datadog_access_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Access Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/access_token"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/access_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/access_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_app_id will be created
  + resource "aws_ssm_parameter" "datadog_app_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Application ID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/app_id"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/app_id"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/ACf0b04d307d8f20074dc09cdb3b4f0a83/app_id"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["ACCESS_TOKEN"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ description = (sensitive value)
        id          = "PROD_DATADOG_ZM_ACCESS_TOKEN"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Used in"     = "flex-plugins" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Used in"     = "flex-plugins"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["APP_ID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ description = (sensitive value)
        id          = "PROD_DATADOG_ZM_APP_ID"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Used in"     = "flex-plugins" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Used in"     = "flex-plugins"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Production - Zambia Twilio account - Chat service SID" -> "Twilio account - Chat service SID"
        id          = "PROD_TWILIO_ZM_CHAT_SERVICE_SID"
        name        = "PROD_TWILIO_ZM_CHAT_SERVICE_SID"
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Helpline"    = "Zambia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Helpline"    = "Zambia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Production - Zambia Twilio account - Chat transfer workflow SID" -> "Twilio account - Chat transfer workflow SID"
        id          = "PROD_TWILIO_ZM_CHAT_WORKFLOW_SID"
        name        = "PROD_TWILIO_ZM_CHAT_WORKFLOW_SID"
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Helpline"    = "Zambia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Helpline"    = "Zambia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["FLEX_PROXY_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Flex Proxy service SID"
        id          = "PROD_TWILIO_ZM_FLEX_PROXY_SERVICE_SID"
        name        = "PROD_TWILIO_ZM_FLEX_PROXY_SERVICE_SID"
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["OPERATING_INFO_KEY"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Operating Key info"
        id          = "PROD_TWILIO_ZM_OPERATING_INFO_KEY"
        name        = "PROD_TWILIO_ZM_OPERATING_INFO_KEY"
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["POST_SURVEY_BOT_CHAT_URL"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description    = (sensitive value)
        id             = "PROD_TWILIO_ZM_POST_SURVEY_BOT_CHAT_URL"
      + insecure_value = (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name           = (sensitive value)
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["S3_BUCKET_DOCS"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Production - XXXXXXXXXXXXXXXXXX Twilio account - S3 Bucket for storing documents" -> "Twilio account - Post Survey bot chat url"
        id          = "PROD_TWILIO_ZM_S3_BUCKET_DOCS"
        name        = "PROD_TWILIO_ZM_S3_BUCKET_DOCS"
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Survey Workflow SID"
        id          = "PROD_TWILIO_ZM_SURVEY_WORKFLOW_SID"
        name        = "PROD_TWILIO_ZM_SURVEY_WORKFLOW_SID"
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SYNC_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Production - Zambia Twilio account - Sync service SID" -> "Twilio account - Sync service "
        id          = "PROD_TWILIO_ZM_SYNC_SID"
        name        = "PROD_TWILIO_ZM_SYNC_SID"
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Helpline"    = "Zambia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Helpline"    = "Zambia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["WORKSPACE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Production - Zambia Twilio account - Workspace SID" -> "Twilio account - Workspace SID"
        id          = "PROD_TWILIO_ZM_WORKSPACE_SID"
        name        = "PROD_TWILIO_ZM_WORKSPACE_SID"
      ~ tags        = {
          - "Environment" = "Production" -> null
          - "Helpline"    = "Zambia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Production"
          - "Helpline"    = "Zambia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.s3_docs_bucket_id will be updated in-place
  ~ resource "aws_ssm_parameter" "s3_docs_bucket_id" {
      + description = "S3 - Docs bucket name"
        id          = "/production/s3/ACf0b04d307d8f20074dc09cdb3b4f0a83/docs_bucket_name"
        name        = "/production/s3/ACf0b04d307d8f20074dc09cdb3b4f0a83/docs_bucket_name"
      ~ tags        = {
          + "Environment" = "production"
          + "Name"        = "/production/s3/ACf0b04d307d8f20074dc09cdb3b4f0a83/docs_bucket_name"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "production"
          + "Name"        = "/production/s3/ACf0b04d307d8f20074dc09cdb3b4f0a83/docs_bucket_name"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.serverless_base_url will be updated in-place
  ~ resource "aws_ssm_parameter" "serverless_base_url" {
      + description    = "Serverless - Base URL"
        id             = "/production/serverless/ACf0b04d307d8f20074dc09cdb3b4f0a83/base_url"
      + insecure_value = (known after apply)
        name           = "/production/serverless/ACf0b04d307d8f20074dc09cdb3b4f0a83/base_url"
      ~ tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/serverless/ACf0b04d307d8f20074dc09cdb3b4f0a83/base_url"
          + "Terraform"   = "true"
        }
      ~ tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/serverless/ACf0b04d307d8f20074dc09cdb3b4f0a83/base_url"
          + "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_auth_token will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_auth_token" {
      + description = "Twilio account - Auth Token"
        id          = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/auth_token"
        name        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/auth_token"
      ~ tags        = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/auth_token"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/auth_token"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_service_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_workflow_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_flex_proxy_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_flex_proxy_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Flex Proxy service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/flex_proxy_service_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_operating_info_key will be created
  + resource "aws_ssm_parameter" "twilio_operating_info_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Operating Info Key"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/operating_info_key"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/operating_info_key"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/operating_info_key"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_post_survey_bot_chat_url[0] will be created
  + resource "aws_ssm_parameter" "twilio_post_survey_bot_chat_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Post Survey Bot Chat URL"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/post_survey_bot_chat_url"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_short_helpline_to_account_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_short_helpline_to_account_sid" {
      + description = "Twilio account - account SID by short helpline"
        id          = "/production/twilio/ZM/account_sid"
        name        = "/production/twilio/ZM/account_sid"
      ~ tags        = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ZM/account_sid"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ZM/account_sid"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Survey Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/survey_workflow_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_sync_sid will be created
  + resource "aws_ssm_parameter" "twilio_sync_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Sync service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/sync_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/sync_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/sync_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_workspace_sid will be created
  + resource "aws_ssm_parameter" "twilio_workspace_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Workspace SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/workspace_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/workspace_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/ACf0b04d307d8f20074dc09cdb3b4f0a83/workspace_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_account_sid will be created
  + resource "github_actions_secret" "flex_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "ZM_PROD_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_auth_token will be created
  + resource "github_actions_secret" "flex_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "ZM_PROD_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_account_sid will be created
  + resource "github_actions_secret" "serverless_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "ZM_PROD_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_auth_token will be created
  + resource "github_actions_secret" "serverless_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "ZM_PROD_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.webchat_serverless_url will be created
  + resource "github_actions_secret" "webchat_serverless_url" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "webchat"
      + secret_name     = "ZM_PROD_SERVERLESS_URL"
      + updated_at      = (known after apply)
    }

  # module.hrmServiceIntegration.null_resource.hrm_static_api_key will be created
  + resource "null_resource" "hrm_static_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Production"
          + "helpline"          = "ChildLine Zambia"
          + "short_environment" = "PROD"
          + "short_helpline"    = "ZM"
        }
    }

  # module.serverless.data.external.service_environment_production will be read during apply
  # (config refers to values not yet known)
 <= data "external" "service_environment_production" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "../../serverless/default/getServerlessServiceEnvironmentData.py",
        ]
      + query   = {
          + "environment_sid"    = (known after apply)
          + "service_sid"        = "ZS6ac8653b2845b206a0a0bbdda861e3e9"
          + "twilio_account_sid" = (sensitive value)
          + "twilio_auth_token"  = (sensitive value)
        }
      + result  = (known after apply)
    }

  # module.serverless.twilio_serverless_services_environments_v1.dev must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "dev" {
      ~ id            = "ZS6ac8653b2845b206a0a0bbdda861e3e9/ZE72f7070654747a8ea2b0d7eef0d230bb" -> (known after apply)
      ~ sid           = "ZE72f7070654747a8ea2b0d7eef0d230bb" -> (known after apply)
      ~ unique_name   = "dev-environment" -> "dev" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.serverless.twilio_serverless_services_environments_v1.production must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "production" {
      ~ id            = "ZS6ac8653b2845b206a0a0bbdda861e3e9/ZE33827bc8d05dff23fd74d4621ab4c43a" -> (known after apply)
      ~ sid           = "ZE33827bc8d05dff23fd74d4621ab4c43a" -> (known after apply)
      ~ unique_name   = "production-environment" -> "production" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.serverless.twilio_serverless_services_v1.serverless will be updated in-place
  ~ resource "twilio_serverless_services_v1" "serverless" {
        id                  = "ZS6ac8653b2845b206a0a0bbdda861e3e9"
      ~ ui_editable         = true -> false
        # (4 unchanged attributes hidden)
    }

  # module.services.null_resource.sync_api_key will be created
  + resource "null_resource" "sync_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Production"
          + "helpline"          = "ChildLine Zambia"
          + "short_environment" = "PROD"
          + "short_helpline"    = "ZM"
        }
    }

  # module.services.twilio_chat_services_v2.flex_chat_service will be updated in-place
  ~ resource "twilio_chat_services_v2" "flex_chat_service" {
      ~ friendly_name                              = "Flex Chat Service" -> "Flex Conversation Service"
        id                                         = "ISaad92e2a240949fca58bbb522ae358d6"
        # (21 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["email"] will be created
  + resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
      + channel_optimized_routing = (known after apply)
      + friendly_name             = "Email"
      + id                        = (known after apply)
      + sid                       = (known after apply)
      + unique_name               = "email"
      + workspace_sid             = "WS4593831952c9961a126f0428c187681d"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ event_callback_url     = "https://serverless-4424-production.twil.io/webhooks/taskrouterCallback" -> (known after apply)
        id                     = "WS4593831952c9961a126f0428c187681d"
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ targets              = [
                              ~ {
                                  ~ expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)" -> "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    # (1 unchanged attribute hidden)
                                },
                            ]
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          ~ expression           = "helpline == \"LifeLine Zambia (ZM)\" AND (twilioNumber==\"messenger:261976427221327\" OR channelType==\"facebook\" OR channelType==\"whatsapp\" OR channelType==\"web\" OR twilioNumber CONTAINS \"+260973553422\" OR channelType==\"twitter\")" -> "helpline == 'LifeLine Zambia (ZM)'"
                          ~ targets              = [
                              ~ {
                                  ~ expression = "worker.routing.skills HAS task.language AND ((worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true" -> "worker.routing.skills HAS task.language AND ((worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true"
                                    # (2 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ expression = "(task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true" -> "(task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true"
                                    # (1 unchanged attribute hidden)
                                },
                            ]
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ expression           = "twilioNumber==\"messenger:261976427221327\" OR channelType==\"web\" OR twilioNumber CONTAINS \"+260973553422\" OR channelType==\"twitter\" OR channelType==\"facebook\" OR channelType==\"whatsapp\"" -> "helpline != 'LifeLine Zambia (ZM)'"
                          ~ targets              = [
                              ~ {
                                  ~ expression = "worker.routing.skills HAS task.language AND ((worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true" -> "worker.routing.skills HAS task.language AND ((worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true"
                                    # (2 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ expression = "(task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true" -> "(task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent)) AND worker.waitingOfflineContact != true"
                                    # (1 unchanged attribute hidden)
                                },
                            ]
                            # (1 unchanged attribute hidden)
                        },
                    ]
                }
            }
        )
        id                       = "WS4593831952c9961a126f0428c187681d/WW4e466f778166949c05bce2814adc9968"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQd5a0305287748585d8e231881b9228f0"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WS4593831952c9961a126f0428c187681d/WWe019e70314e126215f8e5341e4e0e9a8"
        # (3 unchanged attributes hidden)
    }

Plan: 30 to add, 22 to change, 2 to destroy.

Changes to Outputs:
  ~ serverless_environment_production_sid = "ZE33827bc8d05dff23fd74d4621ab4c43a" -> (known after apply)
  ~ serverless_url                        = "https://serverless-4424-production.twil.io" -> (known after apply)
  ~ task_router_chat_task_channel_sid     = "TC23ba59151a0a0a9f3e8d1b04b3e21e22" -> (known after apply)
  ~ task_router_task_channel_sids         = {
      ~ chat    = "TC23ba59151a0a0a9f3e8d1b04b3e21e22" -> (known after apply)
      ~ default = "TCaba522fa228bfae520e264deb937321d" -> (known after apply)
      ~ email   = "" -> (known after apply)
      ~ sms     = "TC2ccff10b2e71c5dbe126aed06f0a1e58" -> (known after apply)
      ~ survey  = "TCdeeef61c90d0822aba144ee799bce447" -> (known after apply)
      ~ video   = "TC5da1c70ca167ee326967b8c427f67cca" -> (known after apply)
      ~ voice   = "TC17560de96974cc225f624397ce90a062" -> (known after apply)
    }
  ~ task_router_voice_task_channel_sid    = "TC17560de96974cc225f624397ce90a062" -> (known after apply)
